cask_args appdir: '/Applications'

tap 'caskroom/fonts'

brew 'grc'                 # generic regex colorizer
brew 'calc'                # cli calculator
brew 'ccrypt'              # strong file encryption
brew 'cmake'
brew 'cppunit'
brew 'gcc'
brew 'glew'
brew 'glfw3'
brew 'hh'                  # history search
brew 'htop'                # activity monitor
brew 'imagemagick'
brew 'multimarkdown'
brew 'ncdu'                # ncurses disk usage browser
brew 'nmap'                # port scanning
brew 'node'
brew 'openssl'
brew 'pandoc'
brew 'pipenv'
brew 'protobuf'
brew 'python3'
brew 'speedtest-cli'
brew 'sqlite'
brew 'tmux'                # terminal multiplexer
brew 'tree'                # file tree viewer
brew 'watch'               # watch for file activity
brew 'wget'
brew 'youtube-dl'          # download youtube videos
brew 'zsh-autosuggestions'


cask 'adium'
cask 'blender'
cask 'calibre'
cask 'dash'
cask 'discord'
cask 'dropbox'
cask 'google-chrome'
cask 'handbrake'
# cask 'mactex'            # disabled. takes forever
cask 'meld'
cask 'meshmixer'
cask 'nomachine'
cask 'pycharm'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'tiled'
cask 'tunnelblick'
cask 'unetbootin'
cask 'virtualbox'
cask 'vlc'
