cask_args appdir: '/Applications'

tap 'caskroom/fonts'

brew 'grc'                 # generic regex colorizer
brew 'calc'                # cli calculator
brew 'ccrypt'              # strong file encryption
brew 'hh'                  # history search
brew 'htop'                # activity monitor
brew 'imagemagick'
brew 'ncdu'                # ncurses disk usage browser
brew 'nmap'                # port scanning
brew 'openssl'
brew 'speedtest-cli'
brew 'tmux'                # terminal multiplexer
brew 'tree'                # file tree viewer
brew 'watch'               # watch for file activity
brew 'wget'
brew 'youtube-dl'          # download youtube videos
brew 'zsh-autosuggestions'

cask 'adium'
cask 'dash'
cask 'discord'
cask 'dropbox'
cask 'google-chrome'
cask 'handbrake'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'tunnelblick'
cask 'virtualbox'
cask 'vlc'
